Trackster-Backend/app/controllers/playlists_controller.rb

    def index
        playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

    def create
        playlist = Playlist.create(playlist_params)
---
INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Reggae"], ["user_id", 2], ["created_at", "2020-03-04 17:32:01.286350"], ["updated_at", "2020-03-04 17:32:01.286350"]]