Trackster-Backend/app/controllers/tracks_controller.rb

    def create

        track = Track.create(track_params)
---
INSERT INTO "tracks" ("title", "duration", "artist", "cover_small", "album_title", "preview", "deezer_track_id", "deezer_album_id", "deezer_artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)