Trackster-Backend/app/controllers/track_playlists_controller.rb

    def index
        trackplaylists = TrackPlaylist.all
---
SELECT "track_playlists".* FROM "track_playlists"

    def create
        trackplaylist = TrackPlaylist.create(trackplaylist_params)
        playlist = Playlist.find(trackplaylist.playlist_id)
---
INSERT INTO "track_playlists" ("track_id", "playlist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["track_id", 14], ["playlist_id", 5], ["created_at", "2020-03-05 10:19:31.348991"], ["updated_at", "2020-03-05 10:19:31.348991"]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]